---
type: ContentNode
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ContentNode

`Autodesk.Revit.DB.ContentNode` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAsset | 2014 | `public Asset GetAsset ()` |
| Method | GetTransform | 2014 | `public Transform GetTransform ()` |